## Concatenation

In [1]:
import pandas as pd

In [4]:
df1 = pd.DataFrame({'A':[1, 2, 3], 'B':[4,5,6]})
df2 = pd.DataFrame({'A':[4, 5, 6], 'B':[7,8,9]})

In [5]:
row_concat = pd.concat([df1, df2], axis = 0)
row_concat

   A  B
0  1  4
1  2  5
2  3  6
0  4  7
1  5  8
2  6  9

In [9]:
row_concat.reset_index()
row_concat

   A  B
0  1  4
1  2  5
2  3  6
0  4  7
1  5  8
2  6  9

In [7]:
col_concat = pd.concat([df1, df2], axis = 1)
col_concat

   A  B  A  B
0  1  4  4  7
1  2  5  5  8
2  3  6  6  9

In [11]:
df3 = pd.DataFrame({'A':[1, 2, 3], 'B':[4,5,6], 'C': [7,8,9]})
df4 = pd.DataFrame({'A':[4, 5, 6], 'B':[7,8,9]})

In [13]:
row_concat1 = pd.concat([df3, df4], axis = 0)
row_concat1

   A  B    C
0  1  4  7.0
1  2  5  8.0
2  3  6  9.0
0  4  7  NaN
1  5  8  NaN
2  6  9  NaN

In [15]:
col_concat1 = pd.concat([df3, df4], axis = 1)
col_concat1

   A  B  C  A  B
0  1  4  7  4  7
1  2  5  8  5  8
2  3  6  9  6  9

## Merging

In [20]:
df1 = pd.DataFrame({'key':['A', 'B', 'C'], 'value':[4,5,6]})
df2 = pd.DataFrame({'key':['B', 'C', 'D'], 'value':[5,6,7]})

In [21]:
inner = pd.merge(df1, df2, on = 'key', how='inner')
inner

  key  value_x  value_y
0   B        5        5
1   C        6        6

In [22]:
outer = pd.merge(df1, df2, on = 'key', how='outer')
outer

  key  value_x  value_y
0   A      4.0      NaN
1   B      5.0      5.0
2   C      6.0      6.0
3   D      NaN      7.0

In [23]:
left = pd.merge(df1, df2, on = 'key', how='left')
left

  key  value_x  value_y
0   A        4      NaN
1   B        5      5.0
2   C        6      6.0

In [24]:
right = pd.merge(df1, df2, on = 'key', how='right')
right

  key  value_x  value_y
0   B      5.0        5
1   C      6.0        6
2   D      NaN        7

## Joining

In [26]:
df1.set_index("key")

     value
key
A        4
B        5
C        6

In [29]:
df1.set_index("key").join(df2.set_index("key"), lsuffix='_x')

     value_x  value
key
A          4    NaN
B          5    5.0
C          6    6.0